---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.StairStringerCantOffset
source: html/184b8bde-a69c-9df1-b4f4-85d86cbfd7c6.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.StairStringerCantOffset Property

Inside stringer could not be created because of insufficient space. Please disable the inside stringer or decrease its width.

## Syntax (C#)
```csharp
public static FailureDefinitionId StairStringerCantOffset { get; }
```